In [1]:
import argparse
from typing import List

import numpy as np
import pandas as pd
from pandas import DataFrame
from sklearn.ensemble import GradientBoostingClassifier, RandomForestClassifier
from sklearn.impute import SimpleImputer
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score, classification_report
from sklearn.model_selection import train_test_split
from sklearn.neural_network import MLPClassifier
from sklearn.preprocessing import OneHotEncoder, StandardScaler
import structlog

In [2]:
def load_data(filepath: str) -> DataFrame:
    return pd.read_csv(filepath, index_col=0)

In [5]:
data: DataFrame = load_data("../data/train.csv")
data

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,,,
1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1.0,1.0,101348.88,1
2,15647311,Hill,608,Spain,Female,41.0,1,83807.86,1,0.0,1.0,112542.58,0
3,15619304,Onio,502,France,Female,42.0,8,159660.80,3,1.0,0.0,113931.57,1
4,15701354,Boni,699,France,Female,39.0,1,0.00,2,0.0,0.0,93826.63,0
5,15737888,Mitchell,850,Spain,Female,43.0,2,125510.82,1,NaN,1.0,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8996,15580623,Yefremova,573,Spain,Male,28.0,8,0.00,2,0.0,0.0,77660.03,0
8997,15578156,Anenechukwu,615,Spain,Male,32.0,5,138521.83,1,1.0,1.0,56897.10,0
8998,15631063,Trentino,710,France,Female,33.0,2,0.00,2,1.0,0.0,72945.32,0
8999,15692577,Tomlinson,674,Germany,Female,38.0,10,83727.68,1,1.0,0.0,45418.12,0
9000,15810910,Royston,702,Spain,Female,38.0,9,0.00,2,1.0,1.0,158527.45,0

In [6]:
data['Exited'].value_counts()

Exited
0    7142
1    1858
Name: count, dtype: int64